# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.


month = int(input("Введите номер месяца от 1 до 12: "))
dict_m = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень",
          10: "Осень", 11: "Осень", 12: "Зима"}
if month <= 12:
    sezon = dict_m.setdefault(month)
    print("%s  - самое прекрасное время года!" % (sezon))
else:
    print("Соответствующего месяца не найдено! Попробуйте снова)")

# -------------------------------------------------------------------------------------------------------------

season_list = ["Зима", "Весна", "Лето", "Осень"]
month = int(input("Введите номер месяца от 1 до 12: "))
if month == 12 or month == 1 or month == 2:
    season = season_list[0]
    print("%s  - самое прекрасное время года!" % (season))
elif month == 3 or month == 4 or month == 5:
    season = season_list[1]
    print("%s  - самое прекрасное время года!" % (season))
elif month == 6 or month == 7 or month == 8:
    season = season_list[2]
    print("%s  - самое прекрасное время года!" % (season))
elif month == 9 or month == 10 or month == 11:
    season = season_list[3]
    print("%s  - самое прекрасное время года!" % (season))