# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом: for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.


from functools import reduce

n = int(input("Введите число для вычисления факториала: "))
my_list = [m for m in range(2, n + 1)]
#print(my_list)
def fact(a, b):
   return a * b


print(reduce(fact, my_list))